data/benchmarks/m6/pinned-vus-16-60s.txt


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 183542  3057.946743/s
    checks_succeeded...: 100.00% 183542 out of 183542
    checks_failed......: 0.00%   0 out of 183542

    ✓ status 200
    ✓ is json

    CUSTOM
    deals_ms.......................: avg=5.86ms  min=555µs    med=5.68ms  p(90)=7.96ms  p(95)=8.89ms  p(99)=11.22ms max=35.15ms 
    detail_ms......................: avg=13.16ms min=2.48ms   med=10.66ms p(90)=21.33ms p(95)=25.55ms p(99)=48ms    max=121.89ms
    endpoint_errors................: 0.00%  0 out of 91771
    products_ms....................: avg=9.69ms  min=2.47ms   med=9.39ms  p(90)=12.86ms p(95)=14.26ms p(99)=17.59ms max=50.43ms 

    HTTP
    http_req_duration..............: avg=10.33ms min=555µs    med=9.25ms  p(90)=15.32ms p(95)=19.2ms  p(99)=32.05ms max=121.89ms
      { expected_response:true }...: avg=10.33ms min=555µs    med=9.25ms  p(90)=15.32ms p(95)=19.2ms  p(99)=32.05ms max=121.89ms
    http_req_failed................: 0.00%  0 out of 91773
    http_reqs......................: 91773  1529.006693/s

    EXECUTION
    iteration_duration.............: avg=10.45ms min=596.12µs med=9.38ms  p(90)=15.44ms p(95)=19.32ms p(99)=32.17ms max=121.98ms
    iterations.....................: 91771  1528.973371/s
    vus............................: 16     min=16         max=16
    vus_max........................: 16     min=16         max=16

    NETWORK
    data_received..................: 2.1 GB 35 MB/s
    data_sent......................: 11 MB  181 kB/s